doc: updated README.md file
